Revit 2027 API
SpecTypeId.HvacPower Property
 Power, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HvacPower { get; }
Public Shared ReadOnly Property HvacPower As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HvacPower {
	ForgeTypeId^ get ();
}
static member HvacPower : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace